Catalogs/бит_СтатьиПаспортаДомаСлужебный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_СтатьиПаспортаДомаСлужебный</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_ШаблоныПаспортаДома</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиПаспортаДома</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_СтатьиПаспортаДомаСлужебный/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		
		Объект.НаименованиеПолное = Объект.Наименование;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяОборотовПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтатьяОборотов) Тогда
		
		СтатьяОборотовПриИзмененииНаСервере();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СтатьяОборотовПриИзмененииНаСервере()
	
	Объект.Наименование 	  = Объект.СтатьяОборотов.Наименование;
	Объект.НаименованиеПолное = Объект.СтатьяОборотов.НаименованиеПолное;
	Объект.Кодификатор 	      = Объект.СтатьяОборотов.Кодификатор;
	
КонецПроцедуры

#КонецОбласти
